//
//  QuestionBrain.swift
//  who is wants to be a millionare
//
//  Created by Нахид Гаджалиев on 07.02.2023.
//

import Foundation

struct QuestionBrain {
    var questions = [
        Question(question: "Так называются дополнения к основному сюжету игры.", answers: ["Сториап", "Апгрейд", "Скилл", "Аддон"], correctAnswer: "Аддон"),
        
        Question(question: "Кого рыбак всегда видит издалека?", answers: ["Червяка", "Рыбовода", "Рыбнадзор", "Рыбака"], correctAnswer: "Рыбака"),
        
        Question(question: "Какой вид транспорта, еще не имеет службы предварительного заказа билетов?", answers: ["Троллейбусный", "Морской", "Авиационный", "Железнодорожный"], correctAnswer: "Троллейбусный"),
        
        Question(question: "Как называется острая мексиканская приправа?", answers: ["Сациви", "Пицца", "Чили", "Лечо"], correctAnswer: "Чили"),
        
        Question(question: "Что означает имя максим?", answers: ["Знания", "Умный", "Великий", "Величайший"], correctAnswer: "Величайший"),
        
        Question(question: "Какой период времени в жизни молодоженов начинается сразу после свадьбы?", answers: ["Мёртвый сезон", "Тихий час", "Медовый месяц", "Санитарный день"], correctAnswer: "Медовый месяц"),
        
        Question(question: "Из чего, согласно поговорке не выкинешь слов?", answers: ["Конституции", "Песни", "Газет", "Молитвы"], correctAnswer: "Песни"),
        
        Question(question: "В честь чего был назван компьютер компании - Макинтош?", answers: ["Сорт яблок", "Населённый пункт", "Зонт", " Вид плаща"], correctAnswer: "Сорт яблок"),
        
        Question(question: "В каком году родился Владимир Набоков?", answers: ["1903", "1899","1889", "1900"], correctAnswer: "1899"),
        
        Question(question: "Когда прошел год дельфина?", answers: ["2002", "2011", "1994", "2007"], correctAnswer: "2007"),
        
        Question(question: "Что даёт дерево сорта антоновка?", answers: ["Яблоки","Мандарины", "Апельсины", "Груши"], correctAnswer: "Яблоки"),
        
        Question(question: "Какой вопрос, по определению, не требует ответа?", answers: ["Каверзный", "Философский", "Риторический", "Экзаменационный"], correctAnswer: "Риторический"),
        
        Question(question: "Кличка основателя группы Коррозия металла", answers: ["Скелет", "Горшок", "Ручейник", "Паук"], correctAnswer: "Паук"),
        
        Question(question: "Сколько стран входит в состав Великобритании?", answers: ["4", "3", "1", "6"], correctAnswer: "4"),
        
        Question(question: "Сколько процентов из жизни ленивцы проводят во сне?", answers: ["70%", "80%", "75%", "85%"], correctAnswer: "75%"),
        
        Question(question: "Как называются новорождённые особи собаки?", answers: ["Котята", "Щенки", "Агнцы", "Кутята"], correctAnswer: "Кутята"),
    ]
}
